tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1937_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1937_H_
#define _PIC16F1937_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTD                         62
#define RD0                           63
#define RD1                           64
#define RD2                           65
#define RD3                           66
#define RD4                           67
#define RD5                           68
#define RD6                           69
#define RD7                           70
#define PORTE                         71
#define RE0                           72
#define RE1                           73
#define RE2                           74
#define RE3                           75
#define PIR1                          76
#define TMR1IF                        77
#define TMR2IF                        78
#define CCP1IF                        79
#define SSPIF                         80
#define TXIF                          81
#define RCIF                          82
#define ADIF                          83
#define TMR1GIF                       84
#define PIR2                          85
#define CCP2IF                        86
#define LCDIF                         87
#define BCLIF                         88
#define EEIF                          89
#define C1IF                          90
#define C2IF                          91
#define OSFIF                         92
#define PIR3                          93
#define TMR4IF                        94
#define TMR6IF                        95
#define CCP3IF                        96
#define CCP4IF                        97
#define CCP5IF                        98
#define TMR0                          99
#define TMR1L                         100
#define TMR1H                         101
#define T1CON                         102
#define TMR1ON                        103
#define nT1SYNC                       104
#define T1OSCEN                       105
#define T1CKPS0                       106
#define T1CKPS                        107
#define T1CKPS1                       108
#define TMR1CS                        109
#define TMR1CS0                       110
#define TMR1CS1                       111
#define T1GCON                        112
#define T1GSS0                        113
#define T1GSS                         114
#define T1GSS1                        115
#define T1GVAL                        116
#define T1GGO_nDONE                   117
#define T1GGO                         118
#define T1GSPM                        119
#define T1GTM                         120
#define T1GPOL                        121
#define TMR1GE                        122
#define TMR2                          123
#define PR2                           124
#define T2CON                         125
#define T2CKPS0                       126
#define T2CKPS                        127
#define T2CKPS1                       128
#define TMR2ON                        129
#define T2OUTPS0                      130
#define T2OUTPS                       131
#define T2OUTPS1                      132
#define T2OUTPS2                      133
#define T2OUTPS3                      134
#define CPSCON0                       135
#define T0XCS                         136
#define CPSOUT                        137
#define CPSRNG                        138
#define CPSRNG0                       139
#define CPSRNG1                       140
#define CPSON                         141
#define CPSCON1                       142
#define CPSCH                         143
#define CPSCH0                        144
#define CPSCH1                        145
#define CPSCH2                        146
#define CPSCH3                        147
#define TRISA                         148
#define TRISA0                        149
#define TRISA1                        150
#define TRISA2                        151
#define TRISA3                        152
#define TRISA4                        153
#define TRISA5                        154
#define TRISA6                        155
#define TRISA7                        156
#define TRISB                         157
#define TRISB0                        158
#define TRISB1                        159
#define TRISB2                        160
#define TRISB3                        161
#define TRISB4                        162
#define TRISB5                        163
#define TRISB6                        164
#define TRISB7                        165
#define TRISC                         166
#define TRISC0                        167
#define TRISC1                        168
#define TRISC2                        169
#define TRISC3                        170
#define TRISC4                        171
#define TRISC5                        172
#define TRISC6                        173
#define TRISC7                        174
#define TRISD                         175
#define TRISD0                        176
#define TRISD1                        177
#define TRISD2                        178
#define TRISD3                        179
#define TRISD4                        180
#define TRISD5                        181
#define TRISD6                        182
#define TRISD7                        183
#define TRISE                         184
#define TRISE0                        185
#define TRISE1                        186
#define TRISE2                        187
#define TRISE3                        188
#define PIE1                          189
#define TMR1IE                        190
#define TMR2IE                        191
#define CCP1IE                        192
#define SSPIE                         193
#define TXIE                          194
#define RCIE                          195
#define ADIE                          196
#define TMR1GIE                       197
#define PIE2                          198
#define CCP2IE                        199
#define LCDIE                         200
#define BCLIE                         201
#define EEIE                          202
#define C1IE                          203
#define C2IE                          204
#define OSFIE                         205
#define PIE3                          206
#define TMR4IE                        207
#define TMR6IE                        208
#define CCP3IE                        209
#define CCP4IE                        210
#define CCP5IE                        211
#define OPTION_REG                    212
#define PS                            213
#define PS0                           214
#define PS1                           215
#define PS2                           216
#define PSA                           217
#define T0SE                          218
#define TMR0SE                        219
#define T0CS                          220
#define TMR0CS                        221
#define INTEDG                        222
#define nWPUEN                        223
#define PCON                          224
#define nBOR                          225
#define nPOR                          226
#define nRI                           227
#define nRMCLR                        228
#define STKUNF                        229
#define STKOVF                        230
#define WDTCON                        231
#define SWDTEN                        232
#define WDTPS                         233
#define WDTPS0                        234
#define WDTPS1                        235
#define WDTPS2                        236
#define WDTPS3                        237
#define WDTPS4                        238
#define OSCTUNE                       239
#define TUN0                          240
#define TUN                           241
#define TUN1                          242
#define TUN2                          243
#define TUN3                          244
#define TUN4                          245
#define TUN5                          246
#define OSCCON                        247
#define SCS0                          248
#define SCS                           249
#define SCS1                          250
#define IRCF                          251
#define IRCF0                         252
#define IRCF1                         253
#define IRCF2                         254
#define IRCF3                         255
#define SPLLEN                        256
#define OSCSTAT                       257
#define HFIOFS                        258
#define LFIOFR                        259
#define MFIOFR                        260
#define HFIOFL                        261
#define HFIOFR                        262
#define OSTS                          263
#define PLLR                          264
#define T1OSCR                        265
#define ADRESL                        266
#define ADRESH                        267
#define ADCON0                        268
#define ADON                          269
#define nDONE                         270
#define GO_nDONE                      271
#define GO                            272
#define ADGO                          273
#define CHS0                          274
#define CHS                           275
#define CHS1                          276
#define CHS2                          277
#define CHS3                          278
#define CHS4                          279
#define ADCON1                        280
#define ADPREF0                       281
#define ADPREF                        282
#define ADPREF1                       283
#define ADNREF                        284
#define ADCS0                         285
#define ADCS                          286
#define ADCS1                         287
#define ADCS2                         288
#define ADFM                          289
#define LATA                          290
#define LATA0                         291
#define LATA1                         292
#define LATA2                         293
#define LATA3                         294
#define LATA4                         295
#define LATA5                         296
#define LATA6                         297
#define LATA7                         298
#define LATB                          299
#define LATB0                         300
#define LATB1                         301
#define LATB2                         302
#define LATB3                         303
#define LATB4                         304
#define LATB5                         305
#define LATB6                         306
#define LATB7                         307
#define LATC                          308
#define LATC0                         309
#define LATC1                         310
#define LATC2                         311
#define LATC3                         312
#define LATC4                         313
#define LATC5                         314
#define LATC6                         315
#define LATC7                         316
#define LATD0                         317
#define LATD                          318
#define LATD1                         319
#define LATD2                         320
#define LATD3                         321
#define LATD4                         322
#define LATD5                         323
#define LATD6                         324
#define LATD7                         325
#define LATE                          326
#define LATE0                         327
#define LATE1                         328
#define LATE2                         329
#define LATE3                         330
#define CM1CON0                       331
#define C1SYNC                        332
#define C1HYS                         333
#define C1SP                          334
#define C1POL                         335
#define C1OE                          336
#define C1OUT                         337
#define C1ON                          338
#define CM1CON1                       339
#define C1NCH0                        340
#define C1NCH                         341
#define C1NCH1                        342
#define C1PCH                         343
#define C1PCH0                        344
#define C1PCH1                        345
#define C1INTN                        346
#define C1INTP                        347
#define CM2CON0                       348
#define C2SYNC                        349
#define C2HYS                         350
#define C2SP                          351
#define C2POL                         352
#define C2OE                          353
#define C2OUT                         354
#define C2ON                          355
#define CM2CON1                       356
#define C2NCH0                        357
#define C2NCH                         358
#define C2NCH1                        359
#define C2PCH                         360
#define C2PCH0                        361
#define C2PCH1                        362
#define C2INTN                        363
#define C2INTP                        364
#define CMOUT                         365
#define MC1OUT                        366
#define MC2OUT                        367
#define BORCON                        368
#define BORRDY                        369
#define SBOREN                        370
#define FVRCON                        371
#define ADFVR0                        372
#define ADFVR                         373
#define ADFVR1                        374
#define CDAFVR0                       375
#define CDAFVR                        376
#define CDAFVR1                       377
#define TSRNG                         378
#define TSEN                          379
#define FVRRDY                        380
#define FVREN                         381
#define DACCON0                       382
#define DACNSS                        383
#define DACPSS                        384
#define DACPSS0                       385
#define DACPSS1                       386
#define DACOE                         387
#define DACLPS                        388
#define DACEN                         389
#define DACCON1                       390
#define DACR0                         391
#define DACR                          392
#define DACR1                         393
#define DACR2                         394
#define DACR3                         395
#define DACR4                         396
#define SRCON0                        397
#define SRPR                          398
#define SRPS                          399
#define SRNQEN                        400
#define SRQEN                         401
#define SRCLK0                        402
#define SRCLK                         403
#define SRCLK1                        404
#define SRCLK2                        405
#define SRLEN                         406
#define SRCON1                        407
#define SRRC1E                        408
#define SRRC2E                        409
#define SRRCKE                        410
#define SRRPE                         411
#define SRSC1E                        412
#define SRSC2E                        413
#define SRSCKE                        414
#define SRSPE                         415
#define APFCON                        416
#define CCP2SEL                       417
#define SSSEL                         418
#define C2OUTSEL                      419
#define SRNQSEL                       420
#define P2BSEL                        421
#define T1GSEL                        422
#define CCP3SEL                       423
#define ANSA0                         424
#define ANSELA                        425
#define ANSA1                         426
#define ANSA2                         427
#define ANSA3                         428
#define ANSA4                         429
#define ANSA5                         430
#define ANSB0                         431
#define ANSELB                        432
#define ANSB1                         433
#define ANSB2                         434
#define ANSB3                         435
#define ANSB4                         436
#define ANSB5                         437
#define ANSELD                        438
#define ANSD0                         439
#define ANSD1                         440
#define ANSD2                         441
#define ANSD3                         442
#define ANSD4                         443
#define ANSD5                         444
#define ANSD6                         445
#define ANSD7                         446
#define ANSELE                        447
#define ANSE0                         448
#define ANSE1                         449
#define ANSE2                         450
#define EEADRL                        451
#define EEADRH                        452
#define EEDATL                        453
#define EEDATH                        454
#define EECON1                        455
#define RD                            456
#define WR                            457
#define WREN                          458
#define WRERR                         459
#define FREE                          460
#define LWLO                          461
#define CFGS                          462
#define EEPGD                         463
#define EECON2                        464
#define RCREG                         465
#define TXREG                         466
#define SP1BRGL                       467
#define SPBRGL                        468
#define SP1BRGH                       469
#define SPBRGH                        470
#define RCSTA                         471
#define RX9D                          472
#define OERR                          473
#define FERR                          474
#define ADDEN                         475
#define CREN                          476
#define SREN                          477
#define RX9                           478
#define SPEN                          479
#define TXSTA                         480
#define TX9D                          481
#define TRMT                          482
#define BRGH                          483
#define SENDB                         484
#define SYNC                          485
#define TXEN                          486
#define TX9                           487
#define CSRC                          488
#define BAUDCON                       489
#define ABDEN                         490
#define WUE                           491
#define BRG16                         492
#define SCKP                          493
#define RCIDL                         494
#define ABDOVF                        495
#define WPUB0                         496
#define WPUB                          497
#define WPUB1                         498
#define WPUB2                         499
#define WPUB3                         500
#define WPUB4                         501
#define WPUB5                         502
#define WPUB6                         503
#define WPUB7                         504
#define WPUE                          505
#define WPUE3                         506
#define SSPBUF                        507
#define SSPADD                        508
#define SSPMSK                        509
#define SSPSTAT                       510
#define BF                            511
#define UA                            512
#define R_nW                          513
#define S                             514
#define P                             515
#define D_nA                          516
#define CKE                           517
#define SMP                           518
#define SSPCON1                       519
#define SSPM0                         520
#define SSPM1                         521
